Repository: SeaDve/Delineate
Catalog: po/*.po
Languages: ga

source: View and edit graphs
ga: Féach ar agus cuir in eagar graif

source: graphviz;dot;graphs;visualization;
ga: grafviz; ponc; graif; léirshamhlú;

source: Delineate provides facilities to edit and draw graphs specified in the DOT language It is designed to be a simple and intuitive tool for creating and editing graphs, with a focus on the user experience.
ga: Soláthraíonn Delineate áiseanna chun graif atá sonraithe sa teanga DOT a chur in eagar agus a tharraingt. Tá sé deartha le bheith ina uirlis shimplí iomasach chun graif a chruthú agus a chur in eagar, ag díriú ar thaithí an úsáideora.

source: The main features of Delineate include the following:
ga: Áirítear iad seo a leanas ar phríomhghnéithe Delineate:

source: 🖼️ Live and interactive preview of the graph as you type
ga: 🖼️ Réamhamharc beo agus idirghníomhach den ghraf agus tú ag clóscríobh

source: ⏺️ Multiple Graphviz layout engines support
ga: ⏺️ Tacaíonn innill leagan amach Il Graphviz

source: 📝 Fully-featured DOT language editor
ga: 📝 Eagarthóir teanga DOT lán-feiceáil

source: 📦 Export graph as PNG, SVG, or JPEG
ga: 📦 Easpórtáil an graf mar PNG, SVG, nó JPEG

source: Zoom Out
ga: Súmáil Amach

source: Reset Zoom
ga: Athshocraigh Zúmáil

source: Zoom In
ga: Súmáil Isteach

source: Search documents
ga: Cuardaigh doiciméid

source: No Recent Documents
ga: Gan Doiciméid le Déanaí

source: No Results
ga: Uimh Torthaí

source: Remove
ga: Bain

# shortcut window
source: General
ga: Ginearálta

# shortcut window
source: Show Shortcuts
ga: Taispeáin Aicearraí

# shortcut window
source: Quit
ga: Scoir

# shortcut window
source: Documents
ga: Doiciméid

# shortcut window
source: New Document
ga: Doiciméad Nua

# shortcut window
source: Open Document
ga: Doiciméad Oscailte

# shortcut window
source: Save
ga: Sábháil

# shortcut window
source: Save As
ga: Sábháil Mar

# shortcut window
source: New Window
ga: Fuinneog Nua

# shortcut window
source: Move Document to New Window
ga: Bog Doiciméad go Fuinneog Nua

# shortcut window
source: Move to Next Tab
ga: Bog go dtí an Chéad Chluaisín Eile

# shortcut window
source: Move to Previous Tab
ga: Bog go dtí an Cluaisín Roimhe Seo

# shortcut window
source: Reorder After Next Tab
ga: Athordú Tar éis an Chéad Chluaisín Eile

# shortcut window
source: Reorder Before Previous Tab
ga: Athordú Roimh an gCluaisín Roimhe Seo

# shortcut window
source: Restore Previously Closed Tab
ga: Athchóirigh an Cluaisín a Dúnta Roimhe Seo

# shortcut window
source: Zoom
ga: Súmáil

# shortcut window
source: Zoom In
ga: Súmáil Isteach

# shortcut window
source: Zoom Out
ga: Súmáil Amach

# shortcut window
source: Reset Zoom
ga: Athshocraigh Zúmáil

source: _New Window
ga: _Fuinneog Nua

source: _Save
ga: _Sábháil

source: Save _As…
ga: Sábháil _Mar…

source: _Discard Changes
ga: _Scaoil Athruithe

source: _Export Graph
ga: _Easpórtáil Graf

source: Export As PNG…
ga: Easpórtáil Mar PNG…

source: Export As SVG…
ga: Easpórtáil Mar SVG…

source: Export As JPEG…
ga: Easpórtáil Mar JPEG…

source: Open _Containing Folder
ga: Oscail _Fillteán ina bhfuil

source: _Keyboard Shortcuts
ga: _Aicearraí méarchláir

source: _About Delineate
ga: _Maidir le Delineate

source: Move _Left
ga: Bog _Clé

source: Move _Right
ga: Bog _Ar dheis

source: _Move to New Window
ga: _Bog go Fuinneog Nua

source: Close _Other Tabs
ga: Dún Cluaisíní Eile

source: _Close
ga: _Dún

source: Open
ga: Oscail

source: Recent Documents
ga: Doiciméid le Déanaí

source: New Document
ga: Doiciméad Nua

source: Main Menu
ga: Príomh-Roghchlár

source: Start or Open a Document
ga: Tosaigh nó Oscail Doiciméad

source: • Press the Open button • Press the New Tab Button • Press Ctrl+N to start a new document • Press Ctrl+O to browse for a document • Drag a file into the window Or, press Ctrl+W to close the window.
ga: • Brúigh an cnaipe Oscailte • Brúigh an Cluaisín Nua • Brúigh Ctrl+N chun doiciméad nua a thosú • Brúigh Ctrl+O chun doiciméad a bhrabhsáil • Tarraing comhad isteach san fhuinneog Nó, brúigh Ctrl+W chun an fhuinneog a dhúnadh.

source: translator-credits
ga: aistritheoir-creidmheasa

source: Donate
ga: Síntiúis

source: Translate
ga: Aistrigh

source: Untitled Document
ga: Doiciméad Gan Teideal

source: Save Document
ga: Sábháil Doiciméad

source: Save Document As
ga: Sábháil Doiciméad Mar

source: Export Graph
ga: Graf Easpórtála

source: _Export
ga: _Easpórtáil

source: Graph exported
ga: Graf easpórtáilte

source: Show in Files
ga: Taispeáin i gComhaid

source: Failed to show in Files
ga: Theip ar thaispeáint i gComhaid

source: Failed to draw graph
ga: Theip ar tharraingt graf

source: Just Now
ga: Díreach Anois

source: An hour ago
ga: Uair an chloig ó shin

source: Yesterday
ga: Inné

source: About a year ago
ga: Timpeall bliain ó shin

source: Failed to save changes to document
ga: Theip ar shábháil na n-athruithe ar an doiciméad

source: Save Changes?
ga: Sábháil Athruithe?

source: Open documents contain unsaved changes. Changes which are not saved will be permanently lost.
ga: Bíonn athruithe gan sábháil i ndoiciméid oscailte. Caillfear go buan athruithe nach sábhálfar.

source: Cancel
ga: Cealaigh

source: _Discard
ga: _Scaoil

source: Failed to load file
ga: Theip ar lódáil an chomhaid

source: Failed to open file
ga: Theip ar an gcomhad a oscailt

source: Graphviz DOT Files
ga: Graphviz Comhaid DOT

source: Failed to open document
ga: Theip ar an doiciméad a oscailt

source: Failed to save document
ga: Theip ar an doiciméad a shábháil

source: Failed to save document as
ga: Theip ar an doiciméad a shábháil mar

source: Failed to discard document changes
ga: Theip ar scriosadh na n-athruithe doiciméad

source: Failed to open containing folder
ga: Theip ar oscailt fillteán ina bhfuil

source: Failed to export graph
ga: Theip ar easpórtáil an ghraf

source: Open Document
ga: Doiciméad Oscailte

source: There are unsaved documents
ga: Tá doiciméid nach bhfuil sábháilte
